In [1]:
people = {
    'first': ['Corey', 'Jane', 'John'],
    'last': ['Schafer', 'Doe', 'Doe'],
    'email': ['CoreyMSchafer@gmail.com', 'JaneDoe@gmail.com', 'JohnDoe@gmail.com']
}

In [2]:
import pandas as pd

In [3]:
df = pd.DataFrame(people)

In [4]:
df

   first     last                    email
0  Corey  Schafer  CoreyMSchafer@gmail.com
1   Jane      Doe        JaneDoe@gmail.com
2   John      Doe        JohnDoe@gmail.com

In [5]:
df['first'] + ' ' + df['last']

0    Corey Schafer
1         Jane Doe
2         John Doe
dtype: object

In [6]:
# we can concatenate two series together to create one concatenated series

In [7]:
df['full_name'] = df['first'] + ' ' + df['last']
# we cannot use dot notation when creating assignments, because Python will think that 
# we are trying to assign an attribute onto the series object.

In [8]:
df

   first     last                    email      full_name
0  Corey  Schafer  CoreyMSchafer@gmail.com  Corey Schafer
1   Jane      Doe        JaneDoe@gmail.com       Jane Doe
2   John      Doe        JohnDoe@gmail.com       John Doe

In [9]:
df.drop(columns=['first', 'last'])
# when we want to remove a single series, just pass in a single series field name
# when we want to remove multiple series, we have to pass in a list of series with , as the delimiter
# df.drop(columns=['first', 'last'])

                     email      full_name
0  CoreyMSchafer@gmail.com  Corey Schafer
1        JaneDoe@gmail.com       Jane Doe
2        JohnDoe@gmail.com       John Doe

In [10]:
df['full_name'].str.split(' ')

0    [Corey, Schafer]
1         [Jane, Doe]
2         [John, Doe]
Name: full_name, dtype: object

In [11]:
df['full_name'].str.split(' ', expand=True)
# we have to use this expand=True method because we want to expand the list into different series

       0        1
0  Corey  Schafer
1   Jane      Doe
2   John      Doe

In [12]:
df[['first', 'last']] = df['full_name'].str.split(' ', expand=True)
# we have created a list of columns, and then assigned them to our string split method to create 
# the two new columns with the values that we want

In [13]:
df

   first     last                    email      full_name
0  Corey  Schafer  CoreyMSchafer@gmail.com  Corey Schafer
1   Jane      Doe        JaneDoe@gmail.com       Jane Doe
2   John      Doe        JohnDoe@gmail.com       John Doe

In [14]:
# df.append({'first': 'James'})
# we encounter this error because this row does not have an index which can be assigned to it in our dataframe.

In [15]:
df.append({'first': 'James'}, ignore_index=True)

   first     last                    email      full_name
0  Corey  Schafer  CoreyMSchafer@gmail.com  Corey Schafer
1   Jane      Doe        JaneDoe@gmail.com       Jane Doe
2   John      Doe        JohnDoe@gmail.com       John Doe
3  James      NaN                      NaN            NaN

In [16]:
df

   first     last                    email      full_name
0  Corey  Schafer  CoreyMSchafer@gmail.com  Corey Schafer
1   Jane      Doe        JaneDoe@gmail.com       Jane Doe
2   John      Doe        JohnDoe@gmail.com       John Doe

In [17]:
people = {
    'first': ['Tony', 'Steve'],
    'last': ['Stark', 'Rogers'],
    'email': ['ironman@avenge.com', 'cap@avenge.com']
}

In [18]:
df2 = pd.DataFrame(people)

In [19]:
df2

   first    last               email
0   Tony   Stark  ironman@avenge.com
1  Steve  Rogers      cap@avenge.com

In [20]:
# we want to be able to append this 'df2' dataframe into our original 'df' dataframe

In [21]:
df.append(df2, ignore_index=True)

A:\Anaconda\lib\site-packages\pandas\core\frame.py:7123: FutureWarning: Sorting because non-concatenation axis is not aligned. A future version
of pandas will change to not sort by default.

To accept the future behavior, pass 'sort=False'.

To retain the current behavior and silence the warning, pass 'sort=True'.

  sort=sort,

                     email  first      full_name     last
0  CoreyMSchafer@gmail.com  Corey  Corey Schafer  Schafer
1        JaneDoe@gmail.com   Jane       Jane Doe      Doe
2        JohnDoe@gmail.com   John       John Doe      Doe
3       ironman@avenge.com   Tony            NaN    Stark
4           cap@avenge.com  Steve            NaN   Rogers

In [22]:
# we received this error because we did not pass in all of the columns in the same order as the original

In [23]:
df.append(df2, ignore_index=True, sort=False)
# future pandas versions will make 'sort=False' the default

   first     last                    email      full_name
0  Corey  Schafer  CoreyMSchafer@gmail.com  Corey Schafer
1   Jane      Doe        JaneDoe@gmail.com       Jane Doe
2   John      Doe        JohnDoe@gmail.com       John Doe
3   Tony    Stark       ironman@avenge.com            NaN
4  Steve   Rogers           cap@avenge.com            NaN

In [24]:
df = df.append(df2, ignore_index=True, sort=False)
# the .append method does not have a inplace=True method to confirm our change, therefore we simply
# just have to assign this returned dataframe to our existing dataframe

In [25]:
df

   first     last                    email      full_name
0  Corey  Schafer  CoreyMSchafer@gmail.com  Corey Schafer
1   Jane      Doe        JaneDoe@gmail.com       Jane Doe
2   John      Doe        JohnDoe@gmail.com       John Doe
3   Tony    Stark       ironman@avenge.com            NaN
4  Steve   Rogers           cap@avenge.com            NaN

In [30]:
df.drop(index=4)
# this will give a returned data frame, that we need to assign again to our existing dataframe to confirm the change

   first     last                    email      full_name
0  Corey  Schafer  CoreyMSchafer@gmail.com  Corey Schafer
1   Jane      Doe        JaneDoe@gmail.com       Jane Doe
2   John      Doe        JohnDoe@gmail.com       John Doe
3   Tony    Stark       ironman@avenge.com            NaN

In [29]:
df

   first     last                    email      full_name
0  Corey  Schafer  CoreyMSchafer@gmail.com  Corey Schafer
1   Jane      Doe        JaneDoe@gmail.com       Jane Doe
2   John      Doe        JohnDoe@gmail.com       John Doe
3   Tony    Stark       ironman@avenge.com            NaN
4  Steve   Rogers           cap@avenge.com            NaN

In [36]:
filt = df['last'] == 'Doe'

In [42]:
df.drop(index=df[filt].index)
# the last .index attribute is important because we only want the index' of the conditionals

   first     last                    email      full_name
0  Corey  Schafer  CoreyMSchafer@gmail.com  Corey Schafer
3   Tony    Stark       ironman@avenge.com            NaN
4  Steve   Rogers           cap@avenge.com            NaN

In [40]:
df

   first     last                    email      full_name
0  Corey  Schafer  CoreyMSchafer@gmail.com  Corey Schafer
1   Jane      Doe        JaneDoe@gmail.com       Jane Doe
2   John      Doe        JohnDoe@gmail.com       John Doe
3   Tony    Stark       ironman@avenge.com            NaN
4  Steve   Rogers           cap@avenge.com            NaN